# AttachToStructure Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..AttachToStructure Method
FabricationRodInfo Class See Also
---
Attaches to the nearest structural element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void AttachToStructure()
```

Visual Basic
---
```text
Public Sub AttachToStructure
```

Visual C++
---
```text
public:
void AttachToStructure()
```

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace